---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructural
source: html/4e3b41ea-7231-b07a-0870-ea7742e6d67f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructural Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinElementsStructural { get; }
```